mizalop/cafe_refactor_orhi/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MKE14Z128xxx7
package_id: MKE14Z128VLH7
mcu_data: ksdk2_0
processor_version: 8.0.1
pin_labels:
- {pin_num: '64', pin_signal: PTA4/ACMP0_OUT/EWM_OUT_b/SWD_DIO, label: SWDIO, identifier: SWDIO}
- {pin_num: '63', pin_signal: PTA5/TCLK1/RESET_b, label: RST#, identifier: RST_n}
- {pin_num: '62', pin_signal: ACMP0_IN2/PTC4/FTM1_CH0/RTC_CLKOUT/EWM_IN/FTM1_QD_PHB/SWD_CLK, label: SWCLK, identifier: SWCLK}
- {pin_num: '1', pin_signal: PTD1/FTM0_CH3/LPSPI1_SIN/FTM2_CH1/FXIO_D1/TRGMUX_OUT2, label: MAG_IN1, identifier: MAG_IN1}
- {pin_num: '2', pin_signal: PTD0/FTM0_CH2/LPSPI1_SCK/FTM2_CH0/FXIO_D0/TRGMUX_OUT1, label: MAG_IN2, identifier: MAG_IN2}
- {pin_num: '3', pin_signal: PTE11/PWT_IN1/LPTMR0_ALT1/FXIO_D5/TRGMUX_OUT5, label: MAG_CTRL, identifier: MAG_CTRL}
- {pin_num: '4', pin_signal: PTE10/CLKOUT/FXIO_D4/TRGMUX_OUT4, label: GRINDER, identifier: GRINDER}
- {pin_num: '5', pin_signal: PTE5/TCLK2/FTM2_QD_PHA/FTM2_CH3/FXIO_D7/EWM_IN, label: PORTA2, identifier: PORTA2}
- {pin_num: '6', pin_signal: PTE4/BUSOUT/FTM2_QD_PHB/FTM2_CH2/FXIO_D6/EWM_OUT_b, label: PORTA1, identifier: PORTA1}
- {pin_num: '13', pin_signal: PTE3/FTM0_FLT0/LPUART2_RTS/TRGMUX_IN6, label: KUNAK_RST, identifier: COM_RST;KUNAK_RST}
- {pin_num: '14', pin_signal: PTD16/FTM0_CH1, label: FAN, identifier: FAN}
- {pin_num: '15', pin_signal: PTD15/FTM0_CH0, label: PGOOD_DC5V, identifier: PGOOD_DC5V}
- {pin_num: '16', pin_signal: DAC0_OUT/PTE9/FTM0_CH7/LPUART2_CTS, label: M1_CL, identifier: M1_CL}
- {pin_num: '17', pin_signal: ACMP0_IN3/PTE8/FTM0_CH6, label: M1_OP, identifier: M1_OP}
- {pin_num: '18', pin_signal: PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0/ACMP1_OUT, label: COM_OP, identifier: COM_OP}
- {pin_num: '19', pin_signal: ACMP1_IN2/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1, label: COM_CL, identifier: COM_CL}
- {pin_num: '20', pin_signal: ADC0_SE11/ACMP0_IN4/EXTAL32/PTC3/FTM0_CH3, label: SENSE_DC32V, identifier: SENSE_DC32V}
- {pin_num: '21', pin_signal: ADC0_SE10/ACMP0_IN5/XTAL32/PTC2/FTM0_CH2, label: M2_OP, identifier: M2_OP}
- {pin_num: '11', pin_signal: EXTAL/PTB7/LPI2C0_SCL, label: EXTAL, identifier: EXTAL}
- {pin_num: '12', pin_signal: XTAL/PTB6/LPI2C0_SDA, label: XTAL, identifier: XTAL}
- {pin_num: '22', pin_signal: PTD7/LPUART2_TX/FTM2_FLT3, label: KUNAK_TXD, identifier: KUNAK_TXD}
- {pin_num: '23', pin_signal: PTD6/LPUART2_RX/FTM2_FLT2, label: KUNAK_RXD, identifier: KUNAK_RXD}
- {pin_num: '24', pin_signal: PTD5/FTM2_CH3/LPTMR0_ALT2/PWT_IN2/TRGMUX_IN7, label: M2_CL, identifier: M2_CL}
- {pin_num: '25', pin_signal: ADC0_SE9/ACMP1_IN3/PTC1/FTM0_CH1, label: LCD_DB7, identifier: LCD_DB7}
- {pin_num: '26', pin_signal: ADC0_SE8/ACMP1_IN4/PTC0/FTM0_CH0, label: LCD_DB5, identifier: LCD_DB5}
- {pin_num: '27', pin_signal: ADC0_SE15/PTC17/FTM1_FLT3/LPI2C1_SCLS, label: LCD_DB3, identifier: LCD_DB3}
- {pin_num: '28', pin_signal: ADC0_SE14/PTC16/FTM1_FLT2/LPI2C1_SDAS, label: LCD_DB1, identifier: LCD_DB1}
- {pin_num: '29', pin_signal: ADC0_SE13/PTC15/FTM1_CH3, label: LCD_DB0, identifier: LCD_DB0}
- {pin_num: '30', pin_signal: ADC0_SE12/PTC14/FTM1_CH2, label: LCD_DB2, identifier: LCD_DB2}
- {pin_num: '31', pin_signal: ADC0_SE7/PTB3/FTM1_CH1/LPSPI0_SIN/FTM1_QD_PHA/TRGMUX_IN2, label: LCD_DB4, identifier: LCD_DB4}
- {pin_num: '32', pin_signal: ADC0_SE6/PTB2/FTM1_CH0/LPSPI0_SCK/FTM1_QD_PHB/TRGMUX_IN3, label: LCD_BKL, identifier: LCD_BKL}
- {pin_num: '34', pin_signal: ADC0_SE4/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3, label: LCD_RS, identifier: LCD_RS}
- {pin_num: '35', pin_signal: PTC9/LPUART1_TX/LPUART0_RTS, label: LCD_RW, identifier: LCD_RW}
- {pin_num: '47', pin_signal: ADC1_SE1/PTA3/LPI2C0_SCL/EWM_IN/LPUART0_TX, label: EXT_UART_TXD, identifier: EXT_UART_TXD}
- {pin_num: '48', pin_signal: ADC1_SE0/PTA2/LPI2C0_SDA/EWM_OUT_b/LPUART0_RX, label: EXT_UART_RXD, identifier: EXT_UART_RXD}
- {pin_num: '49', pin_signal: ADC0_SE1/ACMP0_IN1/PTA1/FTM1_CH1/LPI2C0_SDAS/FXIO_D3/FTM1_QD_PHA/LPUART0_RTS/TRGMUX_OUT0, label: EXT_UART_RTS, identifier: EXT_UART_RTS}
- {pin_num: '52', pin_signal: ADC1_SE4/PTC6/LPUART1_RX, label: DEBUG_RXD, identifier: DEBUG_RXD}
- {pin_num: '51', pin_signal: ADC1_SE5/PTC7/LPUART1_TX, label: DEBUG_TXD, identifier: DEBUG_TXD}
- {pin_num: '50', pin_signal: ADC0_SE0/ACMP0_IN0/PTA0/FTM2_CH1/LPI2C0_SCLS/FXIO_D2/FTM2_QD_PHA/LPUART0_CTS/TRGMUX_OUT3, label: EXT_UART_CTS, identifier: EXT_UART_CTS}
- {pin_num: '59', pin_signal: PTE1/LPSPI0_SIN/LPI2C0_HREQ/LPI2C1_SCL, label: EXT_SPI_SIN, identifier: EXT_SPI_SIN}
- {pin_num: '60', pin_signal: PTE0/LPSPI0_SCK/TCLK1/LPI2C1_SDA/FTM1_FLT2, label: EXT_SPI_SCK, identifier: EXT_SPI_SCK}
- {pin_num: '61', pin_signal: PTC5/FTM2_CH0/RTC_CLKOUT/LPI2C1_HREQ/FTM2_QD_PHB, label: TEC1, identifier: TEC1}
- {pin_num: '54', pin_signal: ADC1_SE10/PTE2/LPSPI0_SOUT/LPTMR0_ALT3/PWT_IN3/LPUART1_CTS, label: EXT_SPI_SOUT, identifier: EXT_SPI_SOUT}
- {pin_num: '36', pin_signal: PTC8/LPUART1_RX/LPUART0_CTS, label: LCD_CE, identifier: LCD_CE}
- {pin_num: '46', pin_signal: ADC1_SE2/PTD2/LPSPI1_SOUT/FXIO_D4/TRGMUX_IN5, label: LED_5VDC, identifier: LED_5VDC}
- {pin_num: '58', pin_signal: PTA10/LPUART0_TX/FXIO_D0, label: TEC2, identifier: TEC2}
- {pin_num: '57', pin_signal: PTA11/LPUART0_RX/FXIO_D1, label: TEC3, identifier: TEC3}
- {pin_num: '56', pin_signal: PTA12/LPI2C1_SDAS, label: TEC4, identifier: TEC4}
- {pin_num: '55', pin_signal: PTA13/LPI2C1_SCLS, label: TEC5, identifier: TEC5}
- {pin_num: '53', pin_signal: ADC1_SE11/PTE6/LPSPI0_PCS2/LPUART1_RTS, label: EXT_SPI_CS, identifier: EXT_SPI_CS}
- {pin_num: '33', pin_signal: ADC0_SE5/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0, label: LCD_DB6, identifier: LCD_DB6}
- {pin_num: '10', pin_signal: VREFL/VSS, label: VREFL, identifier: VREFL}
- {pin_num: '40', pin_signal: VSS61, label: GND, identifier: GND}
- {pin_num: '41', pin_signal: VDD62, label: DC5V, identifier: DC5V;DC5V_1}
- {pin_num: '9', pin_signal: VREFH, label: VREFH, identifier: VREFH}
- {pin_num: '8', pin_signal: VDDA, label: VDDA, identifier: VDDA}
- {pin_num: '7', pin_signal: VDD10, label: DC5V, identifier: DC5V;DC5V_2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

