mizalop/cafe_refactor_orhi/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    ORHY_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
ORHY_InitPins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '4', peripheral: GPIOE, signal: 'GPIO, 10', pin_signal: PTE10/CLKOUT/FXIO_D4/TRGMUX_OUT4, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '6', peripheral: GPIOE, signal: 'GPIO, 4', pin_signal: PTE4/BUSOUT/FTM2_QD_PHB/FTM2_CH2/FXIO_D6/EWM_OUT_b, direction: INPUT}
  - {pin_num: '5', peripheral: GPIOE, signal: 'GPIO, 5', pin_signal: PTE5/TCLK2/FTM2_QD_PHA/FTM2_CH3/FXIO_D7/EWM_IN, direction: INPUT}
  - {pin_num: '1', peripheral: GPIOD, signal: 'GPIO, 1', pin_signal: PTD1/FTM0_CH3/LPSPI1_SIN/FTM2_CH1/FXIO_D1/TRGMUX_OUT2, direction: INPUT}
  - {pin_num: '2', peripheral: GPIOD, signal: 'GPIO, 0', pin_signal: PTD0/FTM0_CH2/LPSPI1_SCK/FTM2_CH0/FXIO_D0/TRGMUX_OUT1, direction: INPUT, gpio_interrupt: kPORT_InterruptOrDMADisabled}
  - {pin_num: '3', peripheral: GPIOE, signal: 'GPIO, 11', pin_signal: PTE11/PWT_IN1/LPTMR0_ALT1/FXIO_D5/TRGMUX_OUT5, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '17', peripheral: FTM0, signal: 'CH, 6', pin_signal: ACMP0_IN3/PTE8/FTM0_CH6, direction: OUTPUT}
  - {pin_num: '16', peripheral: GPIOE, signal: 'GPIO, 9', pin_signal: DAC0_OUT/PTE9/FTM0_CH7/LPUART2_CTS, direction: OUTPUT}
  - {pin_num: '21', peripheral: FTM0, signal: 'CH, 2', pin_signal: ADC0_SE10/ACMP0_IN5/XTAL32/PTC2/FTM0_CH2, direction: OUTPUT}
  - {pin_num: '24', peripheral: GPIOD, signal: 'GPIO, 5', pin_signal: PTD5/FTM2_CH3/LPTMR0_ALT2/PWT_IN2/TRGMUX_IN7, direction: OUTPUT}
  - {pin_num: '18', peripheral: GPIOB, signal: 'GPIO, 5', pin_signal: PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0/ACMP1_OUT, direction: OUTPUT}
  - {pin_num: '19', peripheral: FTM0, signal: 'CH, 4', pin_signal: ACMP1_IN2/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1, direction: OUTPUT}
  - {pin_num: '61', peripheral: GPIOC, signal: 'GPIO, 5', pin_signal: PTC5/FTM2_CH0/RTC_CLKOUT/LPI2C1_HREQ/FTM2_QD_PHB, direction: INPUT}
  - {pin_num: '58', peripheral: GPIOA, signal: 'GPIO, 10', pin_signal: PTA10/LPUART0_TX/FXIO_D0, direction: INPUT}
  - {pin_num: '57', peripheral: GPIOA, signal: 'GPIO, 11', pin_signal: PTA11/LPUART0_RX/FXIO_D1, direction: INPUT}
  - {pin_num: '56', peripheral: GPIOA, signal: 'GPIO, 12', pin_signal: PTA12/LPI2C1_SDAS, direction: INPUT}
  - {pin_num: '55', peripheral: GPIOA, signal: 'GPIO, 13', pin_signal: PTA13/LPI2C1_SCLS, direction: INPUT}
  - {pin_num: '29', peripheral: GPIOC, signal: 'GPIO, 15', pin_signal: ADC0_SE13/PTC15/FTM1_CH3, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '28', peripheral: GPIOC, signal: 'GPIO, 16', pin_signal: ADC0_SE14/PTC16/FTM1_FLT2/LPI2C1_SDAS, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '30', peripheral: GPIOC, signal: 'GPIO, 14', pin_signal: ADC0_SE12/PTC14/FTM1_CH2, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '27', peripheral: GPIOC, signal: 'GPIO, 17', pin_signal: ADC0_SE15/PTC17/FTM1_FLT3/LPI2C1_SCLS, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '31', peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: ADC0_SE7/PTB3/FTM1_CH1/LPSPI0_SIN/FTM1_QD_PHA/TRGMUX_IN2, direction: OUTPUT, pull_select: up,
    pull_enable: enable}
  - {pin_num: '26', peripheral: GPIOC, signal: 'GPIO, 0', pin_signal: ADC0_SE8/ACMP1_IN4/PTC0/FTM0_CH0, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '33', peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: ADC0_SE5/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '25', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: ADC0_SE9/ACMP1_IN3/PTC1/FTM0_CH1, direction: OUTPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '34', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_SE4/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3, direction: OUTPUT, pull_select: up,
    pull_enable: enable}
  - {pin_num: '35', peripheral: GPIOC, signal: 'GPIO, 9', pin_signal: PTC9/LPUART1_TX/LPUART0_RTS, direction: OUTPUT}
  - {pin_num: '36', peripheral: GPIOC, signal: 'GPIO, 8', pin_signal: PTC8/LPUART1_RX/LPUART0_CTS}
  - {pin_num: '32', peripheral: FTM1, signal: 'CH, 0', pin_signal: ADC0_SE6/PTB2/FTM1_CH0/LPSPI0_SCK/FTM1_QD_PHB/TRGMUX_IN3, direction: OUTPUT}
  - {pin_num: '22', peripheral: LPUART2, signal: TX, pin_signal: PTD7/LPUART2_TX/FTM2_FLT3}
  - {pin_num: '23', peripheral: LPUART2, signal: RX, pin_signal: PTD6/LPUART2_RX/FTM2_FLT2}
  - {pin_num: '13', peripheral: GPIOE, signal: 'GPIO, 3', pin_signal: PTE3/FTM0_FLT0/LPUART2_RTS/TRGMUX_IN6, identifier: KUNAK_RST, direction: OUTPUT}
  - {pin_num: '52', peripheral: LPUART1, signal: RX, pin_signal: ADC1_SE4/PTC6/LPUART1_RX}
  - {pin_num: '51', peripheral: LPUART1, signal: TX, pin_signal: ADC1_SE5/PTC7/LPUART1_TX}
  - {pin_num: '14', peripheral: GPIOD, signal: 'GPIO, 16', pin_signal: PTD16/FTM0_CH1, direction: OUTPUT}
  - {pin_num: '46', peripheral: GPIOD, signal: 'GPIO, 2', pin_signal: ADC1_SE2/PTD2/LPSPI1_SOUT/FXIO_D4/TRGMUX_IN5, direction: OUTPUT}
  - {pin_num: '15', peripheral: GPIOD, signal: 'GPIO, 15', pin_signal: PTD15/FTM0_CH0, direction: INPUT, gpio_interrupt: kPORT_InterruptOrDMADisabled}
  - {pin_num: '20', peripheral: ADC0, signal: 'SE, 11', pin_signal: ADC0_SE11/ACMP0_IN4/EXTAL32/PTC3/FTM0_CH3}
  - {pin_num: '63', peripheral: RCM, signal: RESET, pin_signal: PTA5/TCLK1/RESET_b}
  - {pin_num: '64', peripheral: CoreDebug, signal: SWD_DIO, pin_signal: PTA4/ACMP0_OUT/EWM_OUT_b/SWD_DIO}
  - {pin_num: '62', peripheral: CoreDebug, signal: SWD_CLK, pin_signal: ACMP0_IN2/PTC4/FTM1_CH0/RTC_CLKOUT/EWM_IN/FTM1_QD_PHB/SWD_CLK}
  - {pin_num: '10', peripheral: SUPPLY, signal: 'VSS, 0', pin_signal: VREFL/VSS}
  - {pin_num: '40', peripheral: SUPPLY, signal: 'VSS, 3', pin_signal: VSS61}
  - {pin_num: '41', peripheral: SUPPLY, signal: 'VDD, 2', pin_signal: VDD62, identifier: DC5V_1}
  - {pin_num: '9', peripheral: ADC0, signal: VREFH, pin_signal: VREFH}
  - {pin_num: '8', peripheral: SUPPLY, signal: 'VDDA, 0', pin_signal: VDDA}
  - {pin_num: '7', peripheral: SUPPLY, signal: 'VDD, 0', pin_signal: VDD10, identifier: DC5V_2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

