mizalop/cafe_refactor_orhi/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ORHY_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ORHY_InitPins(void)
{
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t TEC2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA10 (pin 58)  */
    GPIO_PinInit(TEC2_GPIO, TEC2_PIN, &TEC2_config);

    gpio_pin_config_t TEC3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA11 (pin 57)  */
    GPIO_PinInit(TEC3_GPIO, TEC3_PIN, &TEC3_config);

    gpio_pin_config_t TEC4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA12 (pin 56)  */
    GPIO_PinInit(TEC4_GPIO, TEC4_PIN, &TEC4_config);

    gpio_pin_config_t TEC5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA13 (pin 55)  */
    GPIO_PinInit(TEC5_GPIO, TEC5_PIN, &TEC5_config);

    gpio_pin_config_t LCD_RS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 34)  */
    GPIO_PinInit(LCD_RS_GPIO, LCD_RS_PIN, &LCD_RS_config);

    gpio_pin_config_t LCD_DB6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 33)  */
    GPIO_PinInit(LCD_DB6_GPIO, LCD_DB6_PIN, &LCD_DB6_config);

    gpio_pin_config_t LCD_DB4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 31)  */
    GPIO_PinInit(LCD_DB4_GPIO, LCD_DB4_PIN, &LCD_DB4_config);

    gpio_pin_config_t COM_OP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB5 (pin 18)  */
    GPIO_PinInit(COM_OP_GPIO, COM_OP_PIN, &COM_OP_config);

    gpio_pin_config_t LCD_DB5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 26)  */
    GPIO_PinInit(LCD_DB5_GPIO, LCD_DB5_PIN, &LCD_DB5_config);

    gpio_pin_config_t LCD_DB7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 25)  */
    GPIO_PinInit(LCD_DB7_GPIO, LCD_DB7_PIN, &LCD_DB7_config);

    gpio_pin_config_t TEC1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 61)  */
    GPIO_PinInit(TEC1_GPIO, TEC1_PIN, &TEC1_config);

    gpio_pin_config_t LCD_RW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 35)  */
    GPIO_PinInit(LCD_RW_GPIO, LCD_RW_PIN, &LCD_RW_config);

    gpio_pin_config_t LCD_DB2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 30)  */
    GPIO_PinInit(LCD_DB2_GPIO, LCD_DB2_PIN, &LCD_DB2_config);

    gpio_pin_config_t LCD_DB0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 29)  */
    GPIO_PinInit(LCD_DB0_GPIO, LCD_DB0_PIN, &LCD_DB0_config);

    gpio_pin_config_t LCD_DB1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 28)  */
    GPIO_PinInit(LCD_DB1_GPIO, LCD_DB1_PIN, &LCD_DB1_config);

    gpio_pin_config_t LCD_DB3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 27)  */
    GPIO_PinInit(LCD_DB3_GPIO, LCD_DB3_PIN, &LCD_DB3_config);

    gpio_pin_config_t MAG_IN2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 2)  */
    GPIO_PinInit(MAG_IN2_GPIO, MAG_IN2_PIN, &MAG_IN2_config);

    gpio_pin_config_t MAG_IN1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 1)  */
    GPIO_PinInit(MAG_IN1_GPIO, MAG_IN1_PIN, &MAG_IN1_config);

    gpio_pin_config_t LED_5VDC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 46)  */
    GPIO_PinInit(LED_5VDC_GPIO, LED_5VDC_PIN, &LED_5VDC_config);

    gpio_pin_config_t M2_CL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD5 (pin 24)  */
    GPIO_PinInit(M2_CL_GPIO, M2_CL_PIN, &M2_CL_config);

    gpio_pin_config_t PGOOD_DC5V_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 15)  */
    GPIO_PinInit(PGOOD_DC5V_GPIO, PGOOD_DC5V_PIN, &PGOOD_DC5V_config);

    gpio_pin_config_t FAN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD16 (pin 14)  */
    GPIO_PinInit(FAN_GPIO, FAN_PIN, &FAN_config);

    gpio_pin_config_t KUNAK_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE3 (pin 13)  */
    GPIO_PinInit(KUNAK_RST_GPIO, KUNAK_RST_PIN, &KUNAK_RST_config);

    gpio_pin_config_t PORTA1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE4 (pin 6)  */
    GPIO_PinInit(PORTA1_GPIO, PORTA1_PIN, &PORTA1_config);

    gpio_pin_config_t PORTA2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE5 (pin 5)  */
    GPIO_PinInit(PORTA2_GPIO, PORTA2_PIN, &PORTA2_config);

    gpio_pin_config_t M1_CL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE9 (pin 16)  */
    GPIO_PinInit(M1_CL_GPIO, M1_CL_PIN, &M1_CL_config);

