mizalop/cafe_refactor_orhi/board/pin_mux.c
    gpio_pin_config_t GRINDER_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE10 (pin 4)  */
    GPIO_PinInit(GRINDER_GPIO, GRINDER_PIN, &GRINDER_config);

    gpio_pin_config_t MAG_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE11 (pin 3)  */
    GPIO_PinInit(MAG_CTRL_GPIO, MAG_CTRL_PIN, &MAG_CTRL_config);

    /* PORTA10 (pin 58) is configured as PTA10 */
    PORT_SetPinMux(TEC2_PORT, TEC2_PIN, kPORT_MuxAsGpio);

    /* PORTA11 (pin 57) is configured as PTA11 */
    PORT_SetPinMux(TEC3_PORT, TEC3_PIN, kPORT_MuxAsGpio);

    /* PORTA12 (pin 56) is configured as PTA12 */
    PORT_SetPinMux(TEC4_PORT, TEC4_PIN, kPORT_MuxAsGpio);

    /* PORTA13 (pin 55) is configured as PTA13 */
    PORT_SetPinMux(TEC5_PORT, TEC5_PIN, kPORT_MuxAsGpio);

    /* PORTA4 (pin 64) is configured as SWD_DIO */
    PORT_SetPinMux(SWDIO_PORT, SWDIO_PIN, kPORT_MuxAlt7);

    /* PORTA5 (pin 63) is configured as RESET_b */
    PORT_SetPinMux(RST_n_PORT, RST_n_PIN, kPORT_MuxAlt7);

    /* PORTB0 (pin 34) is configured as PTB0 */
    PORT_SetPinMux(LCD_RS_PORT, LCD_RS_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB1 (pin 33) is configured as PTB1 */
    PORT_SetPinMux(LCD_DB6_PORT, LCD_DB6_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[1] = ((PORTB->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB2 (pin 32) is configured as FTM1_CH0 */
    PORT_SetPinMux(LCD_BKL_PORT, LCD_BKL_PIN, kPORT_MuxAlt2);

    /* PORTB3 (pin 31) is configured as PTB3 */
    PORT_SetPinMux(LCD_DB4_PORT, LCD_DB4_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB4 (pin 19) is configured as FTM0_CH4 */
    PORT_SetPinMux(COM_CL_PORT, COM_CL_PIN, kPORT_MuxAlt2);

    /* PORTB5 (pin 18) is configured as PTB5 */
    PORT_SetPinMux(COM_OP_PORT, COM_OP_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 26) is configured as PTC0 */
    PORT_SetPinMux(LCD_DB5_PORT, LCD_DB5_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[0] = ((PORTC->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC1 (pin 25) is configured as PTC1 */
    PORT_SetPinMux(LCD_DB7_PORT, LCD_DB7_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[1] = ((PORTC->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC14 (pin 30) is configured as PTC14 */
    PORT_SetPinMux(LCD_DB2_PORT, LCD_DB2_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[14] = ((PORTC->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC15 (pin 29) is configured as PTC15 */
    PORT_SetPinMux(LCD_DB0_PORT, LCD_DB0_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[15] = ((PORTC->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC16 (pin 28) is configured as PTC16 */
    PORT_SetPinMux(LCD_DB1_PORT, LCD_DB1_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[16] = ((PORTC->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC17 (pin 27) is configured as PTC17 */
    PORT_SetPinMux(LCD_DB3_PORT, LCD_DB3_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[17] = ((PORTC->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC2 (pin 21) is configured as FTM0_CH2 */
    PORT_SetPinMux(M2_OP_PORT, M2_OP_PIN, kPORT_MuxAlt2);

    /* PORTC3 (pin 20) is configured as ADC0_SE11 */
    PORT_SetPinMux(SENSE_DC32V_PORT, SENSE_DC32V_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC4 (pin 62) is configured as SWD_CLK */
    PORT_SetPinMux(SWCLK_PORT, SWCLK_PIN, kPORT_MuxAlt7);

    /* PORTC5 (pin 61) is configured as PTC5 */
    PORT_SetPinMux(TEC1_PORT, TEC1_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 52) is configured as LPUART1_RX */
    PORT_SetPinMux(DEBUG_RXD_PORT, DEBUG_RXD_PIN, kPORT_MuxAlt2);

    /* PORTC7 (pin 51) is configured as LPUART1_TX */
    PORT_SetPinMux(DEBUG_TXD_PORT, DEBUG_TXD_PIN, kPORT_MuxAlt2);

    /* PORTC8 (pin 36) is configured as PTC8 */
    PORT_SetPinMux(LCD_CE_PORT, LCD_CE_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 35) is configured as PTC9 */
    PORT_SetPinMux(LCD_RW_PORT, LCD_RW_PIN, kPORT_MuxAsGpio);

