mizalop/cafe_refactor_orhi/board/pin_mux.c
    /* PORTD0 (pin 2) is configured as PTD0 */
    PORT_SetPinMux(MAG_IN2_PORT, MAG_IN2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD0 (pin 2): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(MAG_IN2_PORT, MAG_IN2_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTD1 (pin 1) is configured as PTD1 */
    PORT_SetPinMux(MAG_IN1_PORT, MAG_IN1_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 15) is configured as PTD15 */
    PORT_SetPinMux(PGOOD_DC5V_PORT, PGOOD_DC5V_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD15 (pin 15): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(PGOOD_DC5V_PORT, PGOOD_DC5V_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTD16 (pin 14) is configured as PTD16 */
    PORT_SetPinMux(FAN_PORT, FAN_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 46) is configured as PTD2 */
    PORT_SetPinMux(LED_5VDC_PORT, LED_5VDC_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 24) is configured as PTD5 */
    PORT_SetPinMux(M2_CL_PORT, M2_CL_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 23) is configured as LPUART2_RX */
    PORT_SetPinMux(KUNAK_RXD_PORT, KUNAK_RXD_PIN, kPORT_MuxAlt2);

    /* PORTD7 (pin 22) is configured as LPUART2_TX */
    PORT_SetPinMux(KUNAK_TXD_PORT, KUNAK_TXD_PIN, kPORT_MuxAlt2);

    /* PORTE10 (pin 4) is configured as PTE10 */
    PORT_SetPinMux(GRINDER_PORT, GRINDER_PIN, kPORT_MuxAsGpio);

    /* PORTE11 (pin 3) is configured as PTE11 */
    PORT_SetPinMux(MAG_CTRL_PORT, MAG_CTRL_PIN, kPORT_MuxAsGpio);

    /* PORTE3 (pin 13) is configured as PTE3 */
    PORT_SetPinMux(KUNAK_RST_PORT, KUNAK_RST_PIN, kPORT_MuxAsGpio);

    /* PORTE4 (pin 6) is configured as PTE4 */
    PORT_SetPinMux(PORTA1_PORT, PORTA1_PIN, kPORT_MuxAsGpio);

    /* PORTE5 (pin 5) is configured as PTE5 */
    PORT_SetPinMux(PORTA2_PORT, PORTA2_PIN, kPORT_MuxAsGpio);

    /* PORTE8 (pin 17) is configured as FTM0_CH6 */
    PORT_SetPinMux(M1_OP_PORT, M1_OP_PIN, kPORT_MuxAlt2);

    /* PORTE9 (pin 16) is configured as PTE9 */
    PORT_SetPinMux(M1_CL_PORT, M1_CL_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
